Бухгалтерия_обновление_тест1/src/AccumulationRegisters/РезервыПредстоящихРасходов/РезервыПредстоящихРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РезервыПредстоящихРасходов</name>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетСебестоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.НастройкиХозяйственныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРезервов</name>
    <type>
      <types>CatalogRef.Резервы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектУчетаРезервов</name>
    <type>
      <types>CatalogRef.ОбъектыУчетаРезервовПредстоящихРасходов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Бухгалтерия_обновление_тест1/src/Catalogs/ОбъектыУчетаРезервовПредстоящихРасходов/ОбъектыУчетаРезервовПредстоящихРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбъектыУчетаРезервовПредстоящихРасходов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидРезервов</name>
    <type>
      <types>CatalogRef.Резервы</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <comment>Начало периода создания</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <comment>Конец периода создания</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеНачисления</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельностиНачисления</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовНачисления</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходовНачисления</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеСписания</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельностиСписания</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходовСписания</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаДоходовСписания</name>
    <type>
      <types>Characteristic.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИспользованиеРезерва</name>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛюбаяАналитикаРасходов</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Бухгалтерия_обновление_тест1/src/CommonModules/РезервыПредстоящихРасходов/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиЭтаповЗакрытияМесяца

//++ НЕ УТ

#Область НачислениеСписаниеРезервовПредстоящихРасходов

// Добавляет этап в таблицу этапов закрытия месяца.
// Элементы данной таблицы являются элементами второго уровня в дереве этапов в форме закрытия месяца.
// 
// Параметры:
// 	ТаблицаЭтапов - (См. Обработки.ОперацииЗакрытияМесяца.ЗаполнитьОписаниеЭтаповЗакрытияМесяца)
// 	ТекущийРодитель - Строка - идентификатор группы.
Процедура ДобавитьЭтап_НачислениеСписаниеРезервовПредстоящихРасходов(ТаблицаЭтапов,ТекущийРодитель) Экспорт
	НоваяСтрока = ЗакрытиеМесяцаСервер.ДобавитьЭтапВТаблицу(ТаблицаЭтапов, ТекущийРодитель,
		Перечисления.ОперацииЗакрытияМесяца.НачислениеСписаниеРезервовПредстоящихРасходов,
		Ложь, Истина, Ложь);
	НоваяСтрока.ВыполняетсяВручную = Истина;
	НоваяСтрока.ТекстВыполнить = НСтр("ru='Отразить';uk='Відобразити'");
	НоваяСтрока.ДействиеИспользование = ЗакрытиеМесяцаСервер.ОписаниеДействия_СервернаяПроцедура(
		"РезервыПредстоящихРасходов.Использование_НачислениеСписаниеРезервовПредстоящихРасходов");
	НоваяСтрока.ДействиеВыполнить  = ЗакрытиеМесяцаСервер.ОписаниеДействия_ОткрытьФорму(
		Метаданные.Документы.НачислениеСписаниеРезервовПредстоящихРасходов.Формы.ФормаРабочееМесто.ПолноеИмя());
	НоваяСтрока.ДействиеВыполнить.ПараметрыФормы.Вставить("ВсеОрганизации");

КонецПроцедуры

Процедура Использование_НачислениеСписаниеРезервовПредстоящихРасходов(ПараметрыОбработчика) Экспорт
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, 1);
	
	Запрос = Новый Запрос;
	ЗакрытиеМесяцаСервер.ИнициализироватьЗапрос(Запрос, ПараметрыОбработчика);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбъектыУчетаРезервов.Организация КАК Организация,
	|	ОбъектыУчетаРезервов.ВидРезервов КАК ВидРезервов,
	|	ОбъектыУчетаРезервов.Ссылка КАК ОбъектУчетаРезервов
	|ПОМЕСТИТЬ ВТРезервы
	|ИЗ
	|	Справочник.ОбъектыУчетаРезервовПредстоящихРасходов КАК ОбъектыУчетаРезервов
	|ГДЕ
	|	ОбъектыУчетаРезервов.НачалоПериода <= &КонецПериода
	|	И ОбъектыУчетаРезервов.КонецПериода = ДАТАВРЕМЯ(1,1,1)
	|	И ОбъектыУчетаРезервов.Организация В (&МассивОрганизаций)
	|	И НЕ ОбъектыУчетаРезервов.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	ОбъектыУчетаРезервов.Организация КАК Организация,
	|	ОбъектыУчетаРезервов.ВидРезервов КАК ВидРезервов,
	|	ОбъектыУчетаРезервов.Ссылка КАК ОбъектУчетаРезервов
	|ИЗ
	|	Справочник.ОбъектыУчетаРезервовПредстоящихРасходов КАК ОбъектыУчетаРезервов
	|ГДЕ
	|	ОбъектыУчетаРезервов.НачалоПериода <= &КонецПериода
	|	И ОбъектыУчетаРезервов.КонецПериода >= &КонецПериода
	|	И ОбъектыУчетаРезервов.Организация В (&МассивОрганизаций)
	|	И НЕ ОбъектыУчетаРезервов.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	РезервыПредстоящихРасходов.Организация КАК Организация,
	|	РезервыПредстоящихРасходов.ВидРезервов КАК ВидРезервов,
	|	РезервыПредстоящихРасходов.ОбъектУчетаРезервов КАК ОбъектУчетаРезервов
	|ИЗ
	|	РегистрНакопления.РезервыПредстоящихРасходов.Остатки(&КонецПериода, Организация В (&МассивОрганизаций)) КАК РезервыПредстоящихРасходов
	|ГДЕ
	|	РезервыПредстоящихРасходов.СуммаУпрОстаток <> 0
	|	ИЛИ РезервыПредстоящихРасходов.СуммаРеглОстаток <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ВидРезервов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВидыРезервов.Организация КАК Организация,
	|	ВидыРезервов.ВидРезервов КАК ВидРезервов
	|ПОМЕСТИТЬ ВТРезервыКОтражению
	|ИЗ
	|	ВТРезервы КАК ВидыРезервов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеСписаниеРезервовПредстоящихРасходов КАК ОтражениеРезервов
	|		ПО (ОтражениеРезервов.Дата = &КонецПериода)
	|			И ВидыРезервов.Организация = ОтражениеРезервов.Организация
	|			И (ВидыРезервов.ВидРезервов = ОтражениеРезервов.ВидРезервов)
	|			И (ОтражениеРезервов.Проведен)
	|ГДЕ
	|	ОтражениеРезервов.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъектыРезервов.Организация КАК Организация,
	|	ОбъектыРезервов.ВидРезервов КАК ВидРезервов,
	|	ОбъектыРезервов.ОбъектУчетаРезервов КАК ОбъектУчетаРезервов,
	|	ОтражениеРезервов.Ссылка КАК Документ
	|ПОМЕСТИТЬ ВТОбъектыУчетаРезервовКОтражению
	|ИЗ
	|	ВТРезервы КАК ОбъектыРезервов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеСписаниеРезервовПредстоящихРасходов КАК ОтражениеРезервов
	|		ПО (ОтражениеРезервов.Дата = &КонецПериода)
	|			И ОбъектыРезервов.Организация = ОтражениеРезервов.Организация
	|			И (ОбъектыРезервов.ВидРезервов = ОтражениеРезервов.ВидРезервов)
	|			И (ОтражениеРезервов.Проведен)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеСписаниеРезервовПредстоящихРасходов.Резервы КАК РезервыОтраженияРезервов
	|		ПО ОтражениеРезервов.Ссылка = РезервыОтраженияРезервов.Ссылка
	|			И (ОбъектыРезервов.ОбъектУчетаРезервов = РезервыОтраженияРезервов.ОбъектУчетаРезервов)
	|ГДЕ
	|	РезервыОтраженияРезервов.ОбъектУчетаРезервов ЕСТЬ NULL";
	Запрос.Выполнить();
	
	РазмерыВременныхТаблиц = ЗакрытиеМесяцаСервер.РазмерыВременныхТаблиц(Запрос, ПараметрыОбработчика);
	
	Если РазмерыВременныхТаблиц.ВТРезервы = 0 Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru='Нет объектов учета резервов, требующих отражения начисления или списание резервов';uk='Немає об''єктів обліку резервів, які потребують відображення нарахування або списання резервів'",ОбщегоНазначения.КодОсновногоЯзыка()));
		
	ИначеЕсли РазмерыВременныхТаблиц.ВТОбъектыУчетаРезервовКОтражению <> 0 Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеВыполненСОшибками(
			ПараметрыОбработчика,
			НСтр("ru='Отражение резервов предстоящих расходов выполнено';uk='Відображення резервів майбутніх витрат виконано'",ОбщегоНазначения.КодОсновногоЯзыка()));
		
	ИначеЕсли РазмерыВременныхТаблиц.ВТРезервыКОтражению = 0 Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru='Отражение резервов предстоящих расходов выполнено';uk='Відображення резервів майбутніх витрат виконано'",ОбщегоНазначения.КодОсновногоЯзыка()));
		
	КонецЕсли;	
	
КонецПроцедуры

// Проверки состояния системы, относящиеся к этапу.

Процедура ОписаниеПроверок_НачислениеСписаниеРезервовПредстоящихРасходов(ТаблицаПроверок) Экспорт
	
	// Отражение резервов.
	ОписаниеПроверки = ЗакрытиеМесяцаСервер.ДобавитьОписаниеНовойПроверки(ТаблицаПроверок,
		"ПроверкаНеобходимостиНачислениеСписаниеРезервовПредстоящихРасходов",
		Перечисления.ОперацииЗакрытияМесяца.НачислениеСписаниеРезервовПредстоящихРасходов,
		Перечисления.МоментЗапускаПроверкиОперацииЗакрытияМесяца.ДоИПослеРасчета,
		"РезервыПредстоящихРасходов.ПроверкаНеобходимостиНачислениеСписаниеРезервовПредстоящихРасходов");
	
	ЗакрытиеМесяцаСервер.ЗаполнитьПредставлениеНовойПроверки(ОписаниеПроверки,
		НСтр("ru='Не отражена операция начисления/списания резервов предстоящих расходов';uk='Не відображено операцію нарахування / списання резервів майбутніх витрат'",ОбщегоНазначения.КодОсновногоЯзыка()),
		НСтр("ru='По всем видам резервов должны быть созданы документы ""Начисления и списания резервов предстоящих расходов"".';uk='За всіма видами резервів повинні бути створені документи ""Нарахування та списання резервів майбутніх витрат"".'",ОбщегоНазначения.КодОсновногоЯзыка()));
	
КонецПроцедуры

Процедура ПроверкаНеобходимостиНачислениеСписаниеРезервовПредстоящихРасходов(ПараметрыПроверки) Экспорт
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("Организация", НСтр("ru='Организация';uk='Організація'",ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("ВидРезервов", НСтр("ru='Вид резервов';uk='Вид резервів'",ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ПараметрыРегистрации = ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыРегистрацииПроблемПроверки(
		"ВТРезервыКОтражению",
		НСтр("ru='Не созданы документы ""Начисления и списания резервов предстоящих расходов"" по организации ""%1"" за период %2';uk='Не створені документи ""Нарахування та списання резервів майбутніх витрат"" по організації "" %1"" за період %2'",ОбщегоНазначения.КодОсновногоЯзыка()),
		СписокПолей);
		
	ШаблонТекстаОшибки = НСтр("ru='Для документов ""Начисления и списания резервов предстоящих расходов"" по организации ""%1"" за период %2 указаны не все объекты учета резервов';uk='Для документів ""Нарахування та списання резервів майбутніх витрат"" по організації "" %1"" за період %2 вказані в повному обсязі об''єкти обліку резервів'",ОбщегоНазначения.КодОсновногоЯзыка());
	РасширенныйСписокПолей = СписокПолей.Скопировать();
	РасширенныйСписокПолей.Добавить("ОбъектУчетаРезервов", НСтр("ru='Объект учета резервов';uk='Об''єкт обліку резервів'",ОбщегоНазначения.КодОсновногоЯзыка()));
	РасширенныйСписокПолей.Добавить("Документ", НСтр("ru='Документ начисления и списания резервов';uk='Документ нарахування і списання резервів'",ОбщегоНазначения.КодОсновногоЯзыка()));
	ЗакрытиеМесяцаСервер.ДополнитьПараметрыРегистрацииПроблемПроверки(ПараметрыРегистрации, "ВТОбъектыУчетаРезервовКОтражению", ШаблонТекстаОшибки, РасширенныйСписокПолей, "Документ");
	
	ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемыВыполненияПроверки(
	 	ПараметрыПроверки,
		ПараметрыРегистрации);
	
КонецПроцедуры

#КонецОбласти
//-- НЕ УТ

#КонецОбласти

#КонецОбласти
